app/controllers/afiles_controller.rb

SELECT "afiles".* FROM "afiles"
---
  def index
    @afiles = Afile.all

INSERT INTO "afiles" ("description", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["description", "MyText"], ["created_at", "2015-12-04 10:46:26.553830"], ["updated_at", "2015-12-04 10:46:26.553830"]]
---
  def create
    @afile = Afile.new(afile_params)

    respond_to do |format|
      if @afile.save

DELETE FROM "afiles" WHERE "afiles"."id" = $1  [["id", 980190962]]
---
  def destroy
    @afile.destroy

SELECT  "afiles".* FROM "afiles" WHERE "afiles"."id" = $1 LIMIT 1  [["id", 980190962]]
---
    def set_afile
      @afile = Afile.find(params[:id])