app/controllers/marks_controller.rb

SELECT "marks".* FROM "marks"
---
  def index
    @marks = Mark.all

INSERT INTO "marks" ("mark", "comment", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["mark", 1.5], ["comment", "MyText"], ["created_at", "2015-12-04 10:46:24.170249"], ["updated_at", "2015-12-04 10:46:24.170249"]]
---
  def create
    @mark = Mark.new(mark_params)

    respond_to do |format|
      if @mark.save

DELETE FROM "marks" WHERE "marks"."id" = $1  [["id", 980190962]]
---
  def destroy
    @mark.destroy

SELECT  "marks".* FROM "marks" WHERE "marks"."id" = $1 LIMIT 1  [["id", 980190962]]
---
    def set_mark
      @mark = Mark.find(params[:id])