app/controllers/messages_controller.rb

INSERT INTO "messages" ("header", "text", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["header", "MyString"], ["text", "MyText"], ["created_at", "2015-12-04 10:46:26.176213"], ["updated_at", "2015-12-04 10:46:26.176213"]]
---
  def create
    @message = Message.new(message_params)

    respond_to do |format|
      if @message.save