app/controllers/ratings_controller.rb

  def destroy
    @rating.destroy
---
DELETE FROM "ratings" WHERE "ratings"."id" = $1  [["id", 980190962]]

    def set_rating
      @rating = Rating.find(params[:id])
---
SELECT  "ratings".* FROM "ratings" WHERE "ratings"."id" = $1 LIMIT 1  [["id", 980190962]]