app/controllers/syllabuses_controller.rb

  def index
    @syllabuses = Syllabus.all
---
SELECT "syllabuses".* FROM "syllabuses"

    def set_syllabus
      @syllabus = Syllabus.find(params[:id])
---
SELECT  "syllabuses".* FROM "syllabuses" WHERE "syllabuses"."id" = $1 LIMIT 1  [["id", 980190962]]