app/controllers/teachers_controller.rb

  def destroy
    @teacher.destroy
---
DELETE FROM "teachers" WHERE "teachers"."id" = $1  [["id", 980190962]]